In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass

In [2]:
def sqlalchemy_con(): # Creamos la función para formar el conector (a.k.a. engine)
    try:
        # Solicitamos el usuario
        user = input("Introduce tu usuario de MySQL: ")

        # Solicitamos la contraseña de forma segura
        password = getpass.getpass("Introduce tu contraseña de MySQL: ")

        # Solicitamos la base de datos
        db_name = input("Introduce el nombre de la base de datos: ")

        # Creamos la URL de conexión en base a las variables de antes
        DATABASE_URL = f"mysql+pymysql://{user}:{password}@localhost:3306/{db_name}"

        # Creamos el engine
        engine = create_engine(DATABASE_URL)
        return engine

    except Exception as error:
        print(f"Error al crear la conexión: {error}")
        return None

In [4]:
# Creamos la conexión
engine = sqlalchemy_con()

In [5]:
# Una vez definamos la función, ya sólo nos queda aplicar el código para pasarle a MySQL
#nuestras queries
def rentals_month(engine, month, year):
    try:
        if engine:
            query = """
                SELECT * 
                FROM rental
                WHERE MONTH(rental_date) = %(month)s
                  AND YEAR(rental_date) = %(year)s;
            """

            df = pd.read_sql(query, engine, params={'month': month, 'year': year})

            return df

    except Exception as error:
        print(f"Error: {error}")

In [6]:
def rental_count_month(df, month, year):
    column_name = f"rentals_{month:02d}_{year}"
    grouped_df = df.groupby("customer_id").size().reset_index(name=column_name)
    
    return grouped_df

In [7]:
df_rentals = rentals_month(engine, 5, 2005)
df2_rentals = rentals_month(engine, 7, 2005)

df_1 = rental_count_month(df_rentals, 5, 2005)
df_2 = rental_count_month(df2_rentals, 7, 2005)
df_1

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [8]:
df_2

     customer_id  rentals_07_2005
0              1               12
1              2               14
2              3               13
3              4                5
4              5               16
..           ...              ...
594          595               19
595          596                6
596          597                7
597          598               16
598          599                7

[599 rows x 2 columns]

In [9]:
def compare_rentals(df1,df2):
    merged_df = pd.merge (df1, df2, on='customer_id',how='outer').fillna(0)
    rental_cols = [col for col in merged_df.columns if col != 'customer_id']
    merged_df['difference'] = merged_df[rental_cols[1]] - merged_df[rental_cols[0]]
    
    return merged_df

In [10]:
df_final = compare_rentals(df_1,df_2)